Autodesk.Revit.DB.NumberSystem.SetReferencePick(Autodesk.Revit.DB.Reference)
Sets the reference pick.
Remarks:
It is suggested to get the new reference via getNumberSystemReference() from the host element.
referencePick:
The pick to set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The referencePick is not a valid reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.NumberSystem
An annotation that consists of a series of numeric tags attached to and describing a host element.
Since:
2013